In [1]:
# 1. 다음과 같이 multi-level index를 갖는 데이터프레임을 만들어보라
# 멀티 인덱스
import numpy as np
import pandas as pd
q1 = np.random.randn(6,2)

outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_idex = pd.MultiIndex.from_tuples(list(zip(outside,inside)))

q1_df = pd.DataFrame(q1, columns=('A','B'), index = hier_idex)
q1_df

             A         B
G1 1 -1.312411 -1.231763
   2  0.738476 -0.600558
   3  0.246431 -0.418593
G2 1  1.160817  0.017117
   2  0.770624 -0.056984
   3 -1.834828  0.538285

In [2]:
# 2. 1번 데이터에서 아래와 같은 데이터를 출력해라
# A ~~
# B ~~

q1_df.loc['G1'].loc[1]

A   -1.312411
B   -1.231763
Name: 1, dtype: float64

In [3]:
# 3. range(10)에 대해  2022년 8월 1일 부터 10일까지 10일동안을 datetime index로 가지는 df를 만들어라
dates = pd.date_range('20220801', periods = 10)
q3_df = pd.DataFrame(np.random.randn(10), index = dates)
q3_df

                   0
2022-08-01 -1.119637
2022-08-02  0.568984
2022-08-03  1.227836
2022-08-04 -0.477338
2022-08-05 -1.080196
2022-08-06  1.666595
2022-08-07  1.157446
2022-08-08  0.259546
2022-08-09  0.737836
2022-08-10 -0.578437

In [4]:
# 4~5.
# Heart.csv 파일 읽고 df로 저장
import pandas as pd
q45 = pd.read_csv('../data/Heart.csv')

In [5]:
# 결측치 여부 및 개수
q45.isnull().sum()

Unnamed: 0    0
Age           0
Sex           0
ChestPain     0
RestBP        0
Chol          0
Fbs           0
RestECG       0
MaxHR         0
ExAng         0
Oldpeak       0
Slope         0
Ca            4
Thal          2
AHD           0
dtype: int64

In [6]:
# 'Chestpain'별 평균 chol 수치 계산
q45.groupby('ChestPain').mean('Chol')['Chol']

ChestPain
asymptomatic    250.513889
nonanginal      243.965116
nontypical      244.780000
typical         237.130435
Name: Chol, dtype: float64

In [7]:
# pivot table 로 (AHD,sex)행별로 chol 수치를 나타내는 표
q45.pivot_table(index = ['AHD','Sex'], values='Chol')

               Chol
AHD Sex
No  0    256.750000
    1    231.597826
Yes 0    276.160000
    1    246.061404

In [8]:
# 6. Heart.csv 에서 Sex별로 AHD 의 여부와 관련한 빈도를 체크
# 분할표(차트)
pd.crosstab(q45['Sex'], q45['AHD'])

AHD  No  Yes
Sex
0    72   25
1    92  114

In [9]:
# 7. 다음 dictionary 데이터를 가지고 df를 만들고
# food와 rating을 선택하여 출력

data = {
    'food': ['KFC', 'McDonald', 'SchoolFood'], 
    'price': [1000, 2000, 2500], 
    'rating': [4.5, 3.9, 4.2]
}
q7 = pd.DataFrame(data, index = None)
q7[['food','rating']]

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

In [10]:
# 8. food를 place라는 컬럼으로 바꾸어라
q7.rename(columns={'food':'place'}, inplace = True)
q7

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [11]:
# 9. 다음과 같은 데이터가 있다.
# 아래와 같은 결과가 나오도록 merge를 써서 구현하라

left = pd.DataFrame({'key': ['foo', 'bar', 'poo'], 'lval': [1, 2, 3]})
right = pd.DataFrame({'key': ['bar', 'foo', 'woo'], 'rval': [4, 5, 6]})

pd.merge(left, right, on = 'key', how = 'left')

   key  lval  rval
0  foo     1   5.0
1  bar     2   4.0
2  poo     3   NaN

In [12]:
# 10. 9번 문제를 on = 'key', how = 'inner' 방식으로 할때 데이터프레임
pd.merge(left,right, on = 'key', how = 'inner')

   key  lval  rval
0  foo     1     5
1  bar     2     4